AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
#include <WiFi.h>
#include <WiFiClient.h>
#include <WiFiClientSecure.h>
#include <WiFiManager.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <LiquidCrystal.h>
#include <esp_task_wdt.h>

// ============================================================
// PINAGEM OFICIAL - HARA TECH / ESP32 NODEMCU-32S
// ============================================================
const int LCD_RS_PIN = 23;
const int LCD_ENABLE_PIN = 22;
const int LCD_D4_PIN = 21;
const int LCD_D5_PIN = 19;
const int LCD_D6_PIN = 18;
const int LCD_D7_PIN = 5;
const int PUMP_RELAY_PIN = 26;

// Cada conector da caixa possui um sinal para servo e um sinal ADC para sensor.
// O usuario escolhe apenas SAIDA 1, 2 ou 3; estes GPIOs nunca sao configuraveis.
const int HARA_PORT_COUNT = 3;
const int SERVO_GPIO_PINS[HARA_PORT_COUNT] = {13, 14, 25};
const int SOIL_SENSOR_GPIO_PINS[HARA_PORT_COUNT] = {34, 35, 32};

LiquidCrystal lcd(
  LCD_RS_PIN,
  LCD_ENABLE_PIN,
  LCD_D4_PIN,
  LCD_D5_PIN,
  LCD_D6_PIN,
  LCD_D7_PIN
);
Preferences prefs;
WiFiClient plainClient;
WiFiClientSecure secureClient;

// ============================================================
// CONFIGURACAO - Ajuste via build flags ou edite aqui
// ============================================================
#ifndef API_URL
#define API_URL "https://hara-tech-api.onrender.com/api/v1"
#endif

#ifndef PROVISIONING_SECRET
#define PROVISIONING_SECRET "troque-por-um-segredo-forte-com-pelo-menos-32-caracteres"
#endif

// ============================================================
// PINOS E HARDWARE
// ============================================================
// O modulo instalado no Hara Tech e acionado quando IN recebe nivel HIGH.
const bool PUMP_ACTIVE_HIGH = true;

const int SOIL_RAW_DRY = 4095;
const int SOIL_RAW_WET = 1200;
const int MOISTURE_HYSTERESIS = 5;

// ============================================================
// TEMPOS E TIMEOUTS
// ============================================================
const unsigned long WIFI_RETRY_INTERVAL_MS = 10000;
const unsigned long REGISTER_RETRY_INTERVAL_MS = 30000;
const unsigned long HEARTBEAT_INTERVAL_MS = 60000;
const unsigned long SENSOR_INTERVAL_MS = 2000;
const unsigned long DISPLAY_INTERVAL_MS = 2000;
const unsigned long CONFIG_SYNC_INTERVAL_MS = 10000;
const unsigned long TELEMETRY_INTERVAL_MS = 5000;
const unsigned long COMMAND_INTERVAL_MS = 2000;
const uint8_t COMMAND_ACK_MAX_ATTEMPTS = 3;
const unsigned long COMMAND_ACK_RETRY_DELAY_MS = 500;
const uint8_t COMPLETED_COMMAND_CACHE_SIZE = 12;
const uint16_t HTTP_TIMEOUT_MS = 10000;
const unsigned long WDT_TIMEOUT_SEC = 30;

const int MAX_ZONES = HARA_PORT_COUNT;
const int SERVO_FREQ = 50;
const int SERVO_RESOLUTION = 12;
const int SERVO_PERIOD_US = 20000;
const int SERVO_STEP_DEGREES = 1;
const unsigned long SERVO_STEP_INTERVAL_MS = 20;
const unsigned long SERVO_MOVE_TIMEOUT_MS = 10000;

// ============================================================
// ESTADO GLOBAL
// ============================================================
String deviceId = "";
String deviceToken = "";
String chipId = "";

unsigned long lastWifiRetryAt = 0;
unsigned long lastRegisterAttemptAt = 0;
unsigned long lastHeartbeatAt = 0;
unsigned long lastSensorReadAt = 0;
unsigned long lastDisplayAt = 0;
unsigned long lastConfigSyncAt = 0;
unsigned long lastTelemetryAt = 0;
unsigned long lastCommandPollAt = 0;
unsigned long bootTimeMs = 0;

int soilMoisture = 0;
int zoneSoilMoisture[HARA_PORT_COUNT] = {-1, -1, -1};
bool hasMoistureReading = false;
int lastHttpCode = 0;
bool pumpOn = false;
bool apiReady = false;
bool restartRequested = false;
String lastCommandFailureReason = "";
String completedCommandIds[COMPLETED_COMMAND_CACHE_SIZE];
uint8_t completedCommandCount = 0;
uint8_t completedCommandNext = 0;

struct ActuatorCfg {
  String driver;
  int channel;
  int openAngle;
  int closedAngle;
  int minPulseUs;
  int maxPulseUs;
  bool inverted;
};

struct ZoneCfg {
  int index;
  String name;
  bool enabled;
  String desiredState;
  ActuatorCfg actuator;
  bool hasActuator;
};

struct DeviceCfg {
  int configVersion;
  String operationMode;
  int moistureLimit;
  int heartbeatIntervalSeconds;
  int telemetryIntervalSeconds;
  int configSyncIntervalSeconds;
  String pumpMode;
  int maxSimultaneousZones;
  ZoneCfg zones[MAX_ZONES];
  int zoneCount;
};

struct ZoneState {
  int index;
  int gpio;
  int currentAngle;
  int targetAngle;
  int closedAngle;
  int minPulseUs;
  int maxPulseUs;
  bool inverted;
  bool detachWhenDone;
  unsigned long lastMoveAt;
  String targetState;
  String appliedState;
  bool servoAttached;
};

DeviceCfg config = {
  0,
  "AUTO",
  35,
  (int)(HEARTBEAT_INTERVAL_MS / 1000),
  (int)(TELEMETRY_INTERVAL_MS / 1000),
  (int)(CONFIG_SYNC_INTERVAL_MS / 1000),
  "AUTO",
  0,
  {},
  0,
};
ZoneState zoneStates[MAX_ZONES];
int zoneStateCount = 0;

// ============================================================
// UTILITARIOS
// ============================================================

String getChipId() {
  return String((uint32_t)ESP.getEfuseMac(), HEX);
}

bool isProvisioningSecretConfigured() {
  String secret = String(PROVISIONING_SECRET);
  return secret.length() > 0 &&
         secret != "troque-por-um-segredo-forte-com-pelo-menos-32-caracteres";
}

String buildApiUrl(const String& path) {
  String base = String(API_URL);
  if (base.endsWith("/")) {
    base.remove(base.length() - 1);
  }
  return base + path;
}

bool beginHttp(HTTPClient& http, const String& path) {
  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }
  String url = buildApiUrl(path);
  if (url.startsWith("https://")) {
    secureClient.setInsecure();
    if (!http.begin(secureClient, url)) {
      return false;
    }
  } else if (!http.begin(plainClient, url)) {
    return false;
  }
  http.setTimeout(HTTP_TIMEOUT_MS);
  return true;
}

void addDeviceAuthHeader(HTTPClient& http) {
  http.addHeader("X-Device-Token", deviceToken);
}

void showStatus(const String& line1, const String& line2 = "") {
  lcd.clear();
  lcd.setCursor(0, 0);
  lcd.print(line1.substring(0, 16));
  lcd.setCursor(0, 1);
  lcd.print(line2.substring(0, 16));
}

