AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
// ============================================================
// PERSISTENCIA (Preferences NVS)
// ============================================================

void loadCredentials() {
  prefs.begin("hara", false);
  deviceId = prefs.getString("deviceId", "");
  deviceToken = prefs.getString("deviceToken", "");
  config.configVersion = prefs.getInt("configVersion", 0);
  prefs.end();
}

void loadCompletedCommands() {
  prefs.begin("hara", true);
  String stored = prefs.getString("cmdDone", "");
  prefs.end();

  completedCommandCount = 0;
  completedCommandNext = 0;
  for (uint8_t i = 0; i < COMPLETED_COMMAND_CACHE_SIZE; i++) {
    completedCommandIds[i] = "";
  }

  int start = 0;
  while (start < stored.length() && completedCommandCount < COMPLETED_COMMAND_CACHE_SIZE) {
    int separator = stored.indexOf('\n', start);
    if (separator < 0) {
      separator = stored.length();
    }
    String commandId = stored.substring(start, separator);
    commandId.trim();
    if (commandId.length() > 0) {
      completedCommandIds[completedCommandCount++] = commandId;
    }
    start = separator + 1;
  }
  completedCommandNext = completedCommandCount % COMPLETED_COMMAND_CACHE_SIZE;
}

bool commandAlreadyCompleted(const String& commandId) {
  for (uint8_t i = 0; i < completedCommandCount; i++) {
    if (completedCommandIds[i] == commandId) {
      return true;
    }
  }
  return false;
}

bool commandChangesPhysicalOutput(const char* type) {
  return strcmp(type, "OPEN_ZONE") == 0 ||
         strcmp(type, "CLOSE_ZONE") == 0 ||
         strcmp(type, "PUMP_ON") == 0 ||
         strcmp(type, "PUMP_OFF") == 0;
}

void rememberCompletedCommand(const String& commandId) {
  if (commandId.length() == 0 || commandAlreadyCompleted(commandId)) {
    return;
  }

  completedCommandIds[completedCommandNext] = commandId;
  completedCommandNext = (completedCommandNext + 1) % COMPLETED_COMMAND_CACHE_SIZE;
  if (completedCommandCount < COMPLETED_COMMAND_CACHE_SIZE) {
    completedCommandCount++;
  }

  String stored = "";
  for (uint8_t i = 0; i < COMPLETED_COMMAND_CACHE_SIZE; i++) {
    if (completedCommandIds[i].length() == 0) {
      continue;
    }
    if (stored.length() > 0) {
      stored += '\n';
    }
    stored += completedCommandIds[i];
  }

  prefs.begin("hara", false);
  prefs.putString("cmdDone", stored);
  prefs.end();
}

void saveCredentials(const String& id, const String& token) {
  prefs.begin("hara", false);
  if (id.length() > 0) {
    prefs.putString("deviceId", id);
    deviceId = id;
  }
  if (token.length() > 0) {
    prefs.putString("deviceToken", token);
    deviceToken = token;
  }
  prefs.end();
}

void saveConfigVersion(int version) {
  prefs.begin("hara", false);
  prefs.putInt("configVersion", version);
  config.configVersion = version;
  prefs.end();
}

void clearCredentials() {
  prefs.begin("hara", false);
  prefs.remove("deviceId");
  prefs.remove("deviceToken");
  prefs.remove("configVersion");
  prefs.remove("cmdDone");
  prefs.end();
  deviceId = "";
  deviceToken = "";
  config.configVersion = 0;
  apiReady = false;
  completedCommandCount = 0;
  completedCommandNext = 0;
  for (uint8_t i = 0; i < COMPLETED_COMMAND_CACHE_SIZE; i++) {
    completedCommandIds[i] = "";
  }
}

bool hasDeviceCredentials() {
  return deviceId.length() > 0 && deviceToken.length() > 0;
}

// ============================================================
// WIFI
// ============================================================

bool connectWifiPortal() {
  WiFi.mode(WIFI_STA);
  WiFi.setAutoReconnect(true);
  WiFi.persistent(true);
  WiFiManager wm;
  wm.setConfigPortalTimeout(180);
  wm.setConnectTimeout(15);
  showStatus("Hara Setup", "Conecte WiFi");
  bool ok = wm.autoConnect("HARA_SETUP");
  if (ok) {
    showStatus("WiFi OK", WiFi.localIP().toString());
  } else {
    showStatus("WiFi pendente", "Tentando...");
  }
  return ok;
}

void maintainWifi() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }
  unsigned long now = millis();
  if (now - lastWifiRetryAt < WIFI_RETRY_INTERVAL_MS) {
    return;
  }
  lastWifiRetryAt = now;
  WiFi.reconnect();
  showStatus("Reconectando", "WiFi");
}

// ============================================================
// REGISTRO DO DISPOSITIVO
// ============================================================

bool registerDevice(bool rotateToken) {
  if (!isProvisioningSecretConfigured()) {
    Serial.println("Configure PROVISIONING_SECRET antes de registrar o device.");
    showStatus("Sem segredo", "provisionamento");
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/register")) {
    lastHttpCode = 0;
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  http.addHeader("X-Provisioning-Secret", PROVISIONING_SECRET);
  StaticJsonDocument<256> doc;
  doc["chipId"] = chipId;
  if (rotateToken) {
    doc["rotateToken"] = true;
  }
  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  lastHttpCode = code;
  if (code != 200) {
    Serial.printf("Falha no registro. HTTP %d\n", code);
    http.end();
    return false;
  }
  String response = http.getString();
  StaticJsonDocument<768> res;
  DeserializationError error = deserializeJson(res, response);
  http.end();
  if (error) {
    Serial.printf("JSON invalido no registro: %s\n", error.c_str());
    return false;
  }
  String newDeviceId = res["data"]["deviceId"] | res["deviceId"] | "";
  String newDeviceToken = res["data"]["deviceToken"] | res["deviceToken"] | "";
  if (newDeviceId.length() == 0) {
    Serial.println("Registro sem deviceId na resposta.");
    return false;
  }
  if (newDeviceToken.length() == 0 && deviceToken.length() == 0) {
    if (!rotateToken) {
      Serial.println("Registro sem deviceToken. Tentando rotacionar token.");
      return registerDevice(true);
    }
    Serial.println("Registro sem deviceToken mesmo com rotacao.");
    return false;
  }
  saveCredentials(newDeviceId, newDeviceToken);
  apiReady = hasDeviceCredentials();
  showStatus("Registrado", deviceId);
  return apiReady;
}

bool recoverDeviceRegistration(int httpCode, const char* source) {
  if (httpCode != 401 && httpCode != 404) {
    return false;
  }

  Serial.printf(
    "%s retornou HTTP %d. Apagando cadastro local antigo e registrando novamente.\n",
    source,
    httpCode
  );
  clearCredentials();
  bool registered = registerDevice(true);
  if (registered) {
    Serial.printf("Novo codigo do dispositivo: %s\n", deviceId.c_str());
    showStatus("Novo codigo", deviceId);
  }
  return registered;
}

