AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
void ensureDeviceRegistered() {
  if (hasDeviceCredentials()) {
    apiReady = true;
    return;
  }
  unsigned long now = millis();
  if (now - lastRegisterAttemptAt < REGISTER_RETRY_INTERVAL_MS) {
    return;
  }
  lastRegisterAttemptAt = now;
  showStatus("Registrando", chipId);
  registerDevice(true);
}

// ============================================================
// HEARTBEAT
// ============================================================

bool sendHeartbeat() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/" + deviceId + "/heartbeat")) {
    lastHttpCode = 0;
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  addDeviceAuthHeader(http);
  StaticJsonDocument<256> doc;
  doc["ip"] = WiFi.localIP().toString();
  doc["rssi"] = WiFi.RSSI();
  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  lastHttpCode = code;
  http.end();
  if (code == 200) {
    apiReady = true;
    return true;
  }
  apiReady = false;
  Serial.printf("Heartbeat falhou. HTTP %d\n", code);
  recoverDeviceRegistration(code, "Heartbeat");
  return false;
}

// ============================================================
// SENSORES E ATUADORES
// ============================================================

int readSoilMoisture(int gpio) {
  int raw = analogRead(gpio);
  int percent = map(raw, SOIL_RAW_DRY, SOIL_RAW_WET, 0, 100);
  return constrain(percent, 0, 100);
}

bool isValidHaraPortIndex(int zoneIndex) {
  return zoneIndex >= 0 && zoneIndex < HARA_PORT_COUNT;
}

bool isServoMappedToZone(int zoneIndex, int servoGpio) {
  return isValidHaraPortIndex(zoneIndex) &&
    SERVO_GPIO_PINS[zoneIndex] == servoGpio;
}

void readConfiguredSoilMoisture() {
  for (int i = 0; i < HARA_PORT_COUNT; i++) {
    zoneSoilMoisture[i] = -1;
  }

  int total = 0;
  int readingCount = 0;
  for (int i = 0; i < config.zoneCount; i++) {
    int portIndex = config.zones[i].index;
    if (!isValidHaraPortIndex(portIndex)) {
      continue;
    }
    int moisture = readSoilMoisture(SOIL_SENSOR_GPIO_PINS[portIndex]);
    zoneSoilMoisture[portIndex] = moisture;
    total += moisture;
    readingCount++;
  }

  hasMoistureReading = readingCount > 0;
  soilMoisture = hasMoistureReading ? total / readingCount : 0;
}

void setPump(bool enabled) {
  pumpOn = enabled;
  if (PUMP_ACTIVE_HIGH) {
    digitalWrite(PUMP_RELAY_PIN, enabled ? HIGH : LOW);
  } else {
    digitalWrite(PUMP_RELAY_PIN, enabled ? LOW : HIGH);
  }
}

int angleToPulseUs(int angle, int minPulseUs, int maxPulseUs) {
  return map(constrain(angle, 0, 180), 0, 180, minPulseUs, maxPulseUs);
}

int pulseUsToDuty(int pulseUs) {
  return map(pulseUs, 0, SERVO_PERIOD_US, 0, (1 << SERVO_RESOLUTION) - 1);
}

bool attachServoPwm(int gpio, int stateIndex) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  return ledcAttach(gpio, SERVO_FREQ, SERVO_RESOLUTION);
#else
  double configuredFrequency = ledcSetup(stateIndex, SERVO_FREQ, SERVO_RESOLUTION);
  if (configuredFrequency <= 0) {
    return false;
  }
  ledcAttachPin(gpio, stateIndex);
  return true;
#endif
}

void detachServoPwm(int gpio) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcDetach(gpio);
#else
  ledcDetachPin(gpio);
#endif
}

void writeServoPwm(int gpio, int stateIndex, int duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(gpio, duty);
#else
  ledcWrite(stateIndex, duty);
#endif
}

void applyServoAngle(int stateIndex, int angle) {
  ZoneState& state = zoneStates[stateIndex];
  int effectiveAngle = state.inverted ? (180 - angle) : angle;
  int pulseUs = angleToPulseUs(effectiveAngle, state.minPulseUs, state.maxPulseUs);
  writeServoPwm(state.gpio, stateIndex, pulseUsToDuty(pulseUs));
}

void detachZoneServo(int stateIndex) {
  ZoneState& state = zoneStates[stateIndex];
  if (!state.servoAttached) {
    return;
  }
  detachServoPwm(state.gpio);
  state.servoAttached = false;
  state.gpio = -1;
}

bool setupZoneServo(int stateIndex, const ActuatorCfg& actuator) {
  ZoneState& state = zoneStates[stateIndex];
  state.gpio = actuator.channel;
  state.closedAngle = constrain(actuator.closedAngle, 0, 180);
  state.currentAngle = state.closedAngle;
  state.targetAngle = state.closedAngle;
  state.minPulseUs = constrain(actuator.minPulseUs, 400, 2999);
  state.maxPulseUs = constrain(actuator.maxPulseUs, state.minPulseUs + 1, 3000);
  state.inverted = actuator.inverted;
  state.detachWhenDone = false;
  state.lastMoveAt = millis();
  state.targetState = "CLOSED";
  state.appliedState = "UNKNOWN";

  if (!attachServoPwm(state.gpio, stateIndex)) {
    Serial.printf("Falha ao configurar PWM do servo da zona %d no GPIO %d.\n",
      state.index, state.gpio);
    state.gpio = -1;
    return false;
  }

  state.servoAttached = true;
  applyServoAngle(stateIndex, state.closedAngle);
  state.appliedState = "CLOSED";
  return true;
}

int zoneIndexToStateIndex(int index) {
  for (int i = 0; i < zoneStateCount; i++) {
    if (zoneStates[i].index == index) {
      return i;
    }
  }
  if (zoneStateCount < MAX_ZONES) {
    int pos = zoneStateCount;
    zoneStates[pos].index = index;
    zoneStates[pos].gpio = -1;
    zoneStates[pos].currentAngle = -1;
    zoneStates[pos].targetAngle = -1;
    zoneStates[pos].closedAngle = 10;
    zoneStates[pos].minPulseUs = 500;
    zoneStates[pos].maxPulseUs = 2500;
    zoneStates[pos].inverted = false;
    zoneStates[pos].detachWhenDone = false;
    zoneStates[pos].lastMoveAt = 0;
    zoneStates[pos].targetState = "CLOSED";
    zoneStates[pos].appliedState = "UNKNOWN";
    zoneStates[pos].servoAttached = false;
    zoneStateCount++;
    return pos;
  }
  return -1;
}

int findZoneStateIndex(int index) {
  for (int i = 0; i < zoneStateCount; i++) {
    if (zoneStates[i].index == index) {
      return i;
    }
  }
  return -1;
}

bool setZoneDesiredState(int zoneIndex, const String& desiredState) {
  for (int i = 0; i < config.zoneCount; i++) {
    if (config.zones[i].index == zoneIndex) {
      if (desiredState == "OPEN" && !config.zones[i].enabled) {
        return false;
      }
      config.zones[i].desiredState = desiredState;
      return true;
    }
  }
  return false;
}

bool gpioAlreadyUsedInConfig(int configPosition, int gpio) {
  for (int i = 0; i < configPosition; i++) {
    const ZoneCfg& other = config.zones[i];
    if (other.hasActuator && other.actuator.driver == "ESP32_PWM" &&
        other.actuator.channel == gpio) {
      return true;
    }
  }
  return false;
}

bool stateHasActiveConfig(const ZoneState& state) {
  for (int i = 0; i < config.zoneCount; i++) {
    const ZoneCfg& zone = config.zones[i];
    if (zone.index == state.index && zone.hasActuator &&
        zone.actuator.driver == "ESP32_PWM" &&
        isServoMappedToZone(zone.index, zone.actuator.channel)) {
      return true;
    }
  }
  return false;
}

void scheduleServoDetach(int stateIndex) {
  ZoneState& state = zoneStates[stateIndex];
  if (!state.servoAttached) {
    return;
  }
  state.targetAngle = state.closedAngle;
  state.targetState = "CLOSED";
  state.detachWhenDone = true;
}

void updateServoMovements(unsigned long now);

