AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
  // A bomba so parte depois que pelo menos um registro terminou de abrir.
  setPump(irrigationPathIsSafe());
}

void applyPumpSafety() {
  if (!pumpOn) {
    return;
  }

  int controlledZones;
  int openZones;
  countIrrigationPaths(controlledZones, openZones);

  bool noOpenPath = controlledZones > 0 && openZones == 0;
  bool tooManyOpenZones = config.maxSimultaneousZones > 0 &&
    openZones > config.maxSimultaneousZones;
  if (noOpenPath || tooManyOpenZones) {
    setPump(false);
    if (tooManyOpenZones) {
      Serial.println("Bomba desligada: limite de zonas simultaneas excedido.");
    }
  }
}

// ============================================================
// CONFIGURACAO REMOTA
// ============================================================

bool syncConfigFromApi() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  String path = "/devices/" + deviceId + "/config";
  if (config.configVersion > 0) {
    path += "?configVersion=" + String(config.configVersion);
  }
  if (!beginHttp(http, path)) {
    lastHttpCode = 0;
    return false;
  }
  addDeviceAuthHeader(http);
  int code = http.GET();
  lastHttpCode = code;
  if (code == 304) {
    http.end();
    return true;
  }
  if (code != 200) {
    Serial.printf("Falha no sync de config. HTTP %d\n", code);
    http.end();
    recoverDeviceRegistration(code, "Config");
    return false;
  }
  String response = http.getString();
  http.end();

  // Check the new standardized response format (success.data) or legacy
  DynamicJsonDocument doc(6144);
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    Serial.printf("JSON invalido no config: %s\n", error.c_str());
    return false;
  }

  // Handle both new (success.data) and legacy response formats
  JsonObject configData;
  if (doc["success"] == true && !doc["data"].isNull()) {
    configData = doc["data"].as<JsonObject>();
  } else {
    configData = doc.as<JsonObject>();
  }

  if (configData.isNull()) {
    Serial.println("Config: dados nao encontrados na resposta");
    return false;
  }

  config.operationMode = configData["operationMode"] | "AUTO";
  config.moistureLimit = configData["moistureThreshold"] | 35;
  config.heartbeatIntervalSeconds = max(
    1,
    configData["heartbeatIntervalSeconds"] | (int)(HEARTBEAT_INTERVAL_MS / 1000)
  );
  config.telemetryIntervalSeconds = max(
    1,
    configData["telemetryIntervalSeconds"] | (int)(TELEMETRY_INTERVAL_MS / 1000)
  );
  config.configSyncIntervalSeconds = max(
    1,
    configData["configSyncIntervalSeconds"] | (int)(CONFIG_SYNC_INTERVAL_MS / 1000)
  );
  config.pumpMode = configData["pumpMode"] | "AUTO";
  config.maxSimultaneousZones = configData["maxSimultaneousZones"] | 0;
  int newVersion = configData["configVersion"] | 0;
  JsonArray zonesArray = configData["zones"].as<JsonArray>();
  config.zoneCount = min((int)zonesArray.size(), MAX_ZONES);
  for (int i = 0; i < config.zoneCount; i++) {
    JsonObject z = zonesArray[i];
    config.zones[i].index = z["index"] | i;
    config.zones[i].name = z["name"] | "";
    config.zones[i].enabled = z["enabled"] | true;
    config.zones[i].desiredState = z["desiredState"] | "CLOSED";
    JsonObject act = z["actuator"];
    if (!act.isNull()) {
      config.zones[i].hasActuator = true;
      config.zones[i].actuator.driver = act["driver"] | "ESP32_PWM";
      config.zones[i].actuator.channel = act["channel"] | 0;
      config.zones[i].actuator.openAngle = act["openAngle"] | 90;
      config.zones[i].actuator.closedAngle = act["closedAngle"] | 10;
      config.zones[i].actuator.minPulseUs = act["minPulseUs"] | 500;
      config.zones[i].actuator.maxPulseUs = act["maxPulseUs"] | 2500;
      config.zones[i].actuator.inverted = act["inverted"] | false;
    } else {
      config.zones[i].hasActuator = false;
    }
  }
  saveConfigVersion(newVersion);
  applyZonesFromConfig();
  Serial.printf("Config sync OK. Versao %d, %d zonas\n", newVersion, config.zoneCount);
  showStatus("Config OK", String(newVersion) + " v" + String(config.zoneCount) + "z");
  return true;
}

// ============================================================
// TELEMETRIA
// ============================================================

bool sendTelemetryToApi() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/" + deviceId + "/telemetry")) {
    lastHttpCode = 0;
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  addDeviceAuthHeader(http);
  StaticJsonDocument<4096> doc;
  doc["soilMoisture"] = soilMoisture;
  doc["pumpOn"] = pumpOn;
  doc["firmwareTimestampMs"] = millis();
  doc["rssi"] = WiFi.RSSI();
  doc["lastIp"] = WiFi.localIP().toString();
  doc["uptimeSeconds"] = (millis() - bootTimeMs) / 1000;
  doc["firmwareVersion"] = "1.3.0";
  if (config.zoneCount > 0) {
    JsonArray zonesArray = doc.createNestedArray("zones");
    for (int i = 0; i < config.zoneCount; i++) {
      JsonObject z = zonesArray.createNestedObject();
      int stateIdx = zoneIndexToStateIndex(config.zones[i].index);
      z["zoneIndex"] = config.zones[i].index;
      z["desiredState"] = config.zones[i].desiredState;
      if (isValidHaraPortIndex(config.zones[i].index) &&
          zoneSoilMoisture[config.zones[i].index] >= 0) {
        z["soilMoisture"] = zoneSoilMoisture[config.zones[i].index];
      }
      if (stateIdx >= 0) {
        z["appliedState"] = zoneStates[stateIdx].appliedState;
        if (zoneStates[stateIdx].currentAngle >= 0) {
          z["servoAngle"] = zoneStates[stateIdx].currentAngle;
        }
      } else {
        z["appliedState"] = "UNKNOWN";
      }
    }
  }
  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  lastHttpCode = code;
  http.end();
  if (code == 201) {
    apiReady = true;
    return true;
  }
  apiReady = false;
  Serial.printf("Falha no envio de telemetria. HTTP %d\n", code);
  recoverDeviceRegistration(code, "Telemetria");
  return false;
}

