AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
// ============================================================
// COMANDOS
// ============================================================

bool checkPendingCommands() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/" + deviceId + "/commands/pending")) {
    lastHttpCode = 0;
    return false;
  }
  addDeviceAuthHeader(http);
  int code = http.GET();
  lastHttpCode = code;
  if (code != 200) {
    http.end();
    recoverDeviceRegistration(code, "Comandos");
    return false;
  }
  String response = http.getString();
  http.end();
  DynamicJsonDocument doc(4096);
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    return false;
  }
  // Handle both new (success.data.commands) and legacy (commands) formats
  JsonArray commands;
  if (doc["success"] == true && !doc["data"]["commands"].isNull()) {
    commands = doc["data"]["commands"].as<JsonArray>();
  } else {
    commands = doc["commands"].as<JsonArray>();
  }
  if (commands.isNull() || commands.size() == 0) {
    return true;
  }
  for (JsonObject cmd : commands) {
    const char* cmdId = cmd["id"];
    const char* cmdType = cmd["type"];
    if (cmdId == nullptr || cmdType == nullptr) {
      Serial.println("Comando ignorado: id ou tipo ausente.");
      continue;
    }
    JsonObject payload = cmd["payload"];
    restartRequested = false;
    lastCommandFailureReason = "";
    bool repeated = commandAlreadyCompleted(String(cmdId));
    bool success = true;
    if (repeated) {
      Serial.printf("Comando %s ja executado; reenviando apenas a confirmacao.\n", cmdId);
    } else {
      success = executeCommand(cmdType, payload);
      if (success && commandChangesPhysicalOutput(cmdType)) {
        // Persiste antes do ACK: se a rede cair, o comando reenviado nao move o hardware de novo.
        rememberCompletedCommand(String(cmdId));
      }
    }
    String failReason = lastCommandFailureReason.length() > 0
      ? lastCommandFailureReason
      : "Falha na execucao";
    bool acknowledged = acknowledgeCommand(cmdId, success, success ? "" : failReason);
    if (success && acknowledged && restartRequested) {
      delay(500);
      ESP.restart();
    }
  }
  return true;
}

bool executeCommand(const char* type, JsonObject payload) {
  Serial.printf("Executando comando: %s\n", type);
  if (strcmp(type, "SYNC_CONFIG") == 0) {
    bool synced = syncConfigFromApi();
    if (!synced) {
      lastCommandFailureReason = "Falha ao sincronizar configuracao";
    }
    return synced;
  }
  if (strcmp(type, "RESTART") == 0) {
    restartRequested = true;
    return true;
  }
  if (strcmp(type, "PUMP_ON") == 0) {
    config.pumpMode = "FORCED_ON";
    setPump(irrigationPathIsSafe());
    if (!pumpOn) {
      lastCommandFailureReason = "Nenhum registro aberto para ligar a bomba";
    }
    return pumpOn;
  }
  if (strcmp(type, "PUMP_OFF") == 0) {
    setPump(false);
    config.pumpMode = "FORCED_OFF";
    return true;
  }
  if (strcmp(type, "OPEN_ZONE") == 0 && !payload.isNull()) {
    int zoneIndex = payload["zoneIndex"] | -1;
    if (zoneIndex >= 0 && setZoneDesiredState(zoneIndex, "OPEN")) {
      applyZonesFromConfig();
      applyPumpSafety();
      return waitForZoneMovement(zoneIndex);
    }
    lastCommandFailureReason = "Area invalida ou sem atuador configurado";
    return false;
  }
  if (strcmp(type, "CLOSE_ZONE") == 0 && !payload.isNull()) {
    int zoneIndex = payload["zoneIndex"] | -1;
    if (zoneIndex >= 0 && setZoneDesiredState(zoneIndex, "CLOSED")) {
      applyZonesFromConfig();
      applyPumpSafety();
      return waitForZoneMovement(zoneIndex);
    }
    lastCommandFailureReason = "Area invalida ou sem atuador configurado";
    return false;
  }
  if (strcmp(type, "OTA_UPDATE") == 0) {
    Serial.println("OTA_UPDATE nao implementado neste firmware.");
    lastCommandFailureReason = "Atualizacao OTA nao implementada";
    return false;
  }
  Serial.printf("Tipo de comando desconhecido: %s\n", type);
  lastCommandFailureReason = "Tipo de comando desconhecido";
  return false;
}

bool acknowledgeCommand(const char* commandId, bool success, const String& failReason) {
  if (!hasDeviceCredentials()) {
    return false;
  }
  StaticJsonDocument<256> doc;
  doc["success"] = success;
  if (!success && failReason.length() > 0) {
    doc["failReason"] = failReason;
  }
  String body;
  serializeJson(doc, body);

  for (uint8_t attempt = 0; attempt < COMMAND_ACK_MAX_ATTEMPTS; attempt++) {
    HTTPClient http;
    if (beginHttp(http, "/devices/" + deviceId + "/commands/" + String(commandId) + "/ack")) {
      http.addHeader("Content-Type", "application/json");
      addDeviceAuthHeader(http);
      int code = http.POST(body);
      lastHttpCode = code;
      http.end();
      if (code == 200) {
        return true;
      }
    } else {
      lastHttpCode = 0;
    }

    if (attempt + 1 < COMMAND_ACK_MAX_ATTEMPTS) {
      delay(COMMAND_ACK_RETRY_DELAY_MS);
    }
  }

  return false;
}

// ============================================================
// DISPLAY
// ============================================================

void updateDisplay() {
  String line1 = "Umi " + String(soilMoisture) + "% ";
  line1 += pumpOn ? "B:ON" : "B:OFF";
  String line2;
  if (WiFi.status() != WL_CONNECTED) {
    line2 = "WiFi offline";
  } else if (!hasDeviceCredentials()) {
    line2 = "Sem registro";
  } else if (!apiReady) {
    line2 = "API HTTP " + String(lastHttpCode);
  } else {
    line2 = deviceId + " v" + String(config.configVersion);
  }
  showStatus(line1, line2);
}

// ============================================================
// SETUP
// ============================================================

void setupWatchdog() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdtConfig;
  wdtConfig.timeout_ms = WDT_TIMEOUT_SEC * 1000;
  wdtConfig.idle_core_mask = 0;
  wdtConfig.trigger_panic = true;
  esp_err_t result = esp_task_wdt_reconfigure(&wdtConfig);
  if (result == ESP_ERR_INVALID_STATE) {
    result = esp_task_wdt_init(&wdtConfig);
  }
#else
  esp_err_t result = esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif
  if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) {
    Serial.printf("Falha ao configurar watchdog: %d\n", result);
  }
  if (esp_task_wdt_status(NULL) != ESP_OK) {
    esp_task_wdt_add(NULL);
  }
}

void setup() {
  // Desliga o rele antes de inicializar display, Serial ou Wi-Fi.
  pinMode(PUMP_RELAY_PIN, OUTPUT);
  setPump(false);

