AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
  Serial.begin(115200);
  lcd.begin(16, 2);
  showStatus("Hara Tech", "Inicializando");

  for (int i = 0; i < HARA_PORT_COUNT; i++) {
    pinMode(SOIL_SENSOR_GPIO_PINS[i], INPUT);
  }
  analogReadResolution(12);

  chipId = getChipId();
  loadCredentials();
  loadCompletedCommands();
  bootTimeMs = millis();
  connectWifiPortal();
  if (WiFi.status() == WL_CONNECTED) {
    ensureDeviceRegistered();
    sendHeartbeat();
    syncConfigFromApi();
  }

  // O portal do WiFiManager pode ficar aberto por ate 180 segundos.
  // Ative o watchdog somente depois dele terminar para evitar reinicios
  // enquanto o usuario informa a rede Wi-Fi.
  setupWatchdog();
}

// ============================================================
// LOOP PRINCIPAL
// ============================================================

void loop() {
  unsigned long now = millis();

  updateServoMovements(now);
  maintainWifi();
  if (WiFi.status() == WL_CONNECTED) {
    ensureDeviceRegistered();
  }

  if (now - lastSensorReadAt >= SENSOR_INTERVAL_MS) {
    lastSensorReadAt = now;
    readConfiguredSoilMoisture();
    applyIrrigationControl();
    applyPumpSafety();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastHeartbeatAt >= (unsigned long)config.heartbeatIntervalSeconds * 1000) {
    lastHeartbeatAt = now;
    sendHeartbeat();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastConfigSyncAt >= (unsigned long)config.configSyncIntervalSeconds * 1000) {
    lastConfigSyncAt = now;
    syncConfigFromApi();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastTelemetryAt >= (unsigned long)config.telemetryIntervalSeconds * 1000) {
    lastTelemetryAt = now;
    sendTelemetryToApi();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastCommandPollAt >= COMMAND_INTERVAL_MS) {
    lastCommandPollAt = now;
    checkPendingCommands();
  }

  if (now - lastDisplayAt >= DISPLAY_INTERVAL_MS) {
    lastDisplayAt = now;
    updateDisplay();
  }

  esp_task_wdt_reset();
}
